Revit 2027 API
BuiltInFailures.SplitSketchBasedElementFailures Class
 Failures related to the split sketched based element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SplitSketchBasedElementFailures
Public NotInheritable Class SplitSketchBasedElementFailures
public ref class SplitSketchBasedElementFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplitSketchBasedElementFailures = class end
The BuiltInFailures.SplitSketchBasedElementFailures type exposes the following members.
Properties
Name | Description
NotSplitValidRegions |  The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.
Top
See Also
Reference
Autodesk.Revit.DB Namespace